## TASKS

In [1]:
print("welcome to LW")

welcome to LW

In [3]:
import pyttsx3

In [5]:
myspeaker=pyttsx3.init()

In [10]:
myspeaker.say("Welcome to Linux World")

In [11]:
myspeaker.runAndWait()

In [14]:
db=[1,"vimal","ok",98291]

In [15]:
db.insert(2,"v@gmail.com")

In [16]:
db[3]

'ok'

In [24]:
db={ 
    "id":1,
    "name":"vimal",
    "email":"v@gmail.com",
    "remarks":"ok",
    "mob":98291
  }

Key should be always unique

In [25]:
type(db)

dict

In [26]:
db["mob"]

98291

In [38]:
students ={
    "name":["vimal","abhi","rahul","tom"],
    "remarks": ["ok","good","vgood","good"],
    "mob": [1111,2222,3333,4444]
}

In [39]:
students

{'name': ['vimal', 'abhi', 'rahul', 'tom'],
 'remarks': ['ok', 'good', 'vgood', 'good'],
 'mob': [1111, 2222, 3333, 4444]}

In [40]:
students["mob"][1]

2222

In [41]:
students["mob"][1:3]

[2222, 3333]

We can only do column-wise operation in dictionary wherelse we can only do row-wise operation in list

In [42]:
import pandas

In [45]:
mydb=pandas.DataFrame(students)

In [47]:
type(mydb)

pandas.core.frame.DataFrame

In [48]:
mydb

    name remarks   mob
0  vimal      ok  1111
1   abhi    good  2222
2  rahul   vgood  3333
3    tom    good  4444

In [50]:
mydb[["name","mob"]]

    name   mob
0  vimal  1111
1   abhi  2222
2  rahul  3333
3    tom  4444

In [51]:
mydb.loc[2]

name       rahul
remarks    vgood
mob         3333
Name: 2, dtype: object

In [52]:
mydb.loc[[2,3]]

    name remarks   mob
2  rahul   vgood  3333
3    tom    good  4444

In [53]:
mydb.loc[2:3]

    name remarks   mob
2  rahul   vgood  3333
3    tom    good  4444